---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoiseAmount
source: html/7a1fa31f-efe2-7e51-20df-8e4390a78d1e.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoiseAmount Property

The property labeled "Amount" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoiseAmount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".